window.abilities = [

    {
        name: '데미지 감소',
        levels: [
            [ 5, '받는 데미지 3% 감소' ],
            [ 10, '받는 피해 10% 감소' ],
            [ 15, '받는 피해 15% 감소' ]
        ]
    },

    {
        name: '필살기 턴 감소',
        levels: [
            [ 10, '게임 시작 시 모든 필살기 턴 1턴 감소' ],
            [ 20, '게임 시작 시 모든 필살기 턴 2턴 감소' ]
        ]
    },

    {
        name: '봉쇄 저항',
        levels: [
            [ 10, '캐릭터 봉쇄 지속시간 1턴 감소' ],
            [ 15, '캐릭터 봉쇄 지속시간 2턴 감소' ],
            [ 20, '캐릭터 봉쇄 지속시간 3턴 감소' ]
        ]
    },

    {
        name: '선장 무효 효과 저항',
        levels: [
            [ 10, '선장 무효 효과 1턴 감소' ],
            [ 15, '선장 무효 효과 2턴 감소' ],
            [ 20, '선장 무효 효과 3턴 감소' ]
        ]
    },

    {
        name: '매턴 회복',
        levels: [
            [ 5, '매 턴 종료 시 체력 100 회복' ],
            [ 8, '매 턴 종료 시 체력 200 회복' ],
            [ 12, '매 턴 종료 시 체력 300 회복' ],
            [ 16, '매 턴 종료 시 체력 500 회복' ],
            [ 24, '매 턴 종료 시 체력 1000 회복' ]
        ]
    },

    {
        name: '회복력 증가',
        levels: [
            [ 5, '선원의 회복력 100 증가' ],
            [ 8, '크루의 회복력 200 증가' ],
            [ 12, '크루의 회복력 300 증가' ],
            [ 16, '크루의 회복력 500 증가' ],
            [ 24, '크루의 회복력 1000 증가' ]
        ]
    },

    {
        name: '슬롯 일치 확률 증가',
        levels: [
            [ 5, '일치 슬롯 등장 확률 20% 증가' ],
            [ 10, '일치 슬롯 등장 확률 22.5% 증가' ],
            [ 20, '일치 슬롯 등장 확률 25% 증가' ]
        ]
    },

    {
        name: '독 데미지 감소',
        levels: [
            [ 10, '독에 대한 피해 20% 감소' ],
            [ 15, '독에 대한 피해 50% 감소' ],
            [ 20, '독에 대한 피해 100% 감소' ]
        ]
    },

    {
        name: '	맵 데미지 감소',
        levels: [
            [ 10, '맵 데미지 50% 감소' ],
            [ 20, '맵 데미지 100% 감소' ]
        ]
    },

    {
        name: '가끔 체력 1로 버티기',
        levels: [
            [ 5, '가끔 체력 1로 버티기 확률 5%증가' ],
            [ 10, '가끔 체력 1로 버티기 확률 10%증가' ],
            [ 20, '가끔 체력 1로 버티기 확률 20%증가' ]
        ]
    }

];
